Tutorials/2D/forwardStep/LeastSquares/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues 
(
    volScalarFieldValue alphaQGD 0.3
);

regions
(
    boxToCell
    {
        box (2.3 0.1 -1) (2.5 0.3 1);
        fieldValues
        (
            volScalarFieldValue alphaQGD 0.5
        );
    }
);


// ************************************************************************* //
